pub const ROMAJI_TABLE: &[(&str, &str)] = &[
    // -- 4文字 --
    // っ系
    ("ltsu", "っ"), ("xtsu", "っ"),

    // っち系
    ("tcha", "っちゃ"), ("tchi", "っち"), ("tchu", "っちゅ"),
    ("tche", "っちぇ"), ("tcho", "っちょ"),

    // ふゅ
    ("hwyu", "ふゅ"),

    // -- 3文字 --
    // か行
    ("kya", "きゃ"), ("kyi", "きぃ"), ("kyu", "きゅ"), ("kye", "きぇ"), ("kyo", "きょ"),

    // さ行
    ("sya", "しゃ"), ("syi", "しぃ"), ("syu", "しゅ"), ("sye", "しぇ"), ("syo", "しょ"),
    ("sha", "しゃ"), ("shu", "しゅ"), ("she", "しぇ"), ("sho", "しょ"),
    ("swa", "すぁ"), ("swi", "すぃ"), ("swu", "すぅ"), ("swe", "すぇ"), ("swo", "すぉ"),

    // た行
    ("tya", "ちゃ"), ("tyi", "ちぃ"), ("tyu", "ちゅ"), ("tye", "ちぇ"), ("tyo", "ちょ"),
    ("cha", "ちゃ"), ("chu", "ちゅ"), ("che", "ちぇ"), ("cho", "ちょ"),
    ("cya", "ちゃ"), ("cyi", "ちぃ"), ("cyu", "ちゅ"), ("cye", "ちぇ"), ("cyo", "ちょ"),
    ("tha", "てゃ"), ("thi", "てぃ"), ("t'i", "てぃ"), ("t'yu", "てゅ"), ("thu", "てゅ"), ("the", "てぇ"), ("tho", "てょ"),
    ("twa", "とぁ"), ("twi", "とぃ"), ("twu", "とぅ"), ("t'u", "とぅ"), ("twe", "とぇ"), ("two", "とぉ"),

    // つ系
    ("tsa", "つぁ"), ("tsi", "つぃ"), ("tse", "つぇ"), ("tso", "つぉ"),

    // だ行
    ("dya", "ぢゃ"), ("dyi", "ぢぃ"), ("dyu", "ぢゅ"), ("dye", "ぢぇ"), ("dyo", "ぢょ"),
    ("dha", "でゃ"), ("dhi", "でぃ"), ("d'i", "でぃ"), ("d'yu", "でゅ"), ("dhu", "でゅ"), ("dhe", "でぇ"), ("dho", "でょ"),
    ("dwa", "どぁ"), ("dwi", "どぃ"), ("dwu", "どぅ"), ("d'u", "どぅ"), ("dwe", "どぇ"), ("dwo", "どぉ"),

    // に行
    ("nya", "にゃ"), ("nyi", "にぃ"), ("nyu", "にゅ"), ("nye", "にぇ"), ("nyo", "にょ"),

    // ひ行
    ("hya", "ひゃ"), ("hyi", "ひぃ"), ("hyu", "ひゅ"), ("hye", "ひぇ"), ("hyo", "ひょ"),

    // ふ行
    ("fya", "ふゃ"), ("fyu", "ふゅ"), ("fyo", "ふょ"),
    ("hwa", "ふぁ"), ("hwi", "ふぃ"), ("hwe", "ふぇ"), ("hwo", "ふぉ"),
    ("fyi", "ふぃ"), ("fye", "ふぇ"),

    // み行
    ("mya", "みゃ"), ("myi", "みぃ"), ("myu", "みゅ"), ("mye", "みぇ"), ("myo", "みょ"),

    // り行
    ("rya", "りゃ"), ("ryi", "りぃ"), ("ryu", "りゅ"), ("rye", "りぇ"), ("ryo", "りょ"),

    // が行
    ("gya", "ぎゃ"), ("gyi", "ぎぃ"), ("gyu", "ぎゅ"), ("gye", "ぎぇ"), ("gyo", "ぎょ"),

    // ざ行
    ("zya", "じゃ"), ("zyi", "じぃ"), ("zyu", "じゅ"), ("zye", "じぇ"), ("zyo", "じょ"),

    // じゃ行
    ("jya", "じゃ"), ("jyi", "じぃ"), ("jyu", "じゅ"), ("jye", "じぇ"), ("jyo", "じょ"),

    // ば行
    ("bya", "びゃ"), ("byi", "びぃ"), ("byu", "びゅ"), ("bye", "びぇ"), ("byo", "びょ"),

    // ぱ行
    ("pya", "ぴゃ"), ("pyi", "ぴぃ"), ("pyu", "ぴゅ"), ("pye", "ぴぇ"), ("pyo", "ぴょ"),

    // ゔ行
    ("vya", "ゔゃ"), ("vyi", "ゔぃ"), ("vyu", "ゔゅ"), ("vye", "ゔぇ"), ("vyo", "ゔょ"),

    // くぁ行
    ("kwa", "くぁ"), ("kwi", "くぃ"), ("kwu", "くぅ"), ("kwe", "くぇ"), ("kwo", "くぉ"),

    // ぐぁ行
    ("gwa", "ぐぁ"), ("gwi", "ぐぃ"), ("gwu", "ぐぅ"), ("gwe", "ぐぇ"), ("gwo", "ぐぉ"),

    // うぃ等
    ("wha", "うぁ"), ("whi", "うぃ"), ("whu", "う"), ("whe", "うぇ"), ("who", "うぉ"),
    ("wi", "うぃ"), ("we", "うぇ"),

    // いぇ
    ("ye", "いぇ"),

    // ゃ行
    ("xya", "ゃ"), ("xyu", "ゅ"), ("xyo", "ょ"),
    ("lya", "ゃ"), ("lyu", "ゅ"), ("lyo", "ょ"),

    // ゎ
    ("xwa", "ゎ"), ("lwa", "ゎ"),

    // ヵ行
    ("xka", "ゕ"), ("lka", "ゕ"),
    ("xke", "ゖ"), ("lke", "ゖ"),

    // っ系
    ("ltu", "っ"), ("xtu", "っ"),

    // -- 2文字 --
    // か行
    ("ka", "か"), ("ki", "き"), ("ku", "く"), ("ke", "け"), ("ko", "こ"),

    // か行の表記揺れ
    ("ca", "か"), ("ci", "し"), ("cu", "く"), ("ce", "せ"), ("co", "こ"),
    ("qa", "くぁ"), ("qi", "くぃ"), ("qu", "く"), ("qe", "くぇ"), ("qo", "くぉ"),

    // さ行
    ("sa", "さ"), ("si", "し"), ("su", "す"), ("se", "せ"), ("so", "そ"),

    // た行
    ("ta", "た"), ("ti", "ち"), ("tu", "つ"), ("te", "て"), ("to", "と"),

    // な行
    ("na", "な"), ("ni", "に"), ("nu", "ぬ"), ("ne", "ね"), ("no", "の"),

    // は行
    ("ha", "は"), ("hi", "ひ"), ("hu", "ふ"), ("fu", "ふ"), ("he", "へ"), ("ho", "ほ"),
    ("fa", "ふぁ"), ("fi", "ふぃ"), ("fe", "ふぇ"), ("fo", "ふぉ"),

    // ま行
    ("ma", "ま"), ("mi", "み"), ("mu", "む"), ("me", "め"), ("mo", "も"),

    // や行
    ("ya", "や"), ("yu", "ゆ"), ("yo", "よ"),

    // ら行
    ("ra", "ら"), ("ri", "り"), ("ru", "る"), ("re", "れ"), ("ro", "ろ"),

    // わ行
    ("wa", "わ"), ("wi", "うぃ"), ("wu", "う"), ("we", "うぇ"), ("wo", "を"),

    // が行
    ("ga", "が"), ("gi", "ぎ"), ("gu", "ぐ"), ("ge", "げ"), ("go", "ご"),

    // ざ行
    ("za", "ざ"), ("zi", "じ"), ("zu", "ず"), ("ze", "ぜ"), ("zo", "ぞ"),
    ("ji", "じ"),

    // だ行
    ("da", "だ"), ("di", "ぢ"), ("du", "づ"), ("de", "で"), ("do", "ど"),

    // ば行
    ("ba", "ば"), ("bi", "び"), ("bu", "ぶ"), ("be", "べ"), ("bo", "ぼ"),

    // ぱ行
    ("pa", "ぱ"), ("pi", "ぴ"), ("pu", "ぷ"), ("pe", "ぺ"), ("po", "ぽ"),

    // ヘボン式
    ("shi", "し"), ("chi", "ち"), ("tsu", "つ"),
    ("ja", "じゃ"), ("ju", "じゅ"), ("je", "じぇ"), ("jo", "じょ"),

    // 小書き母音
    ("xa", "ぁ"), ("xi", "ぃ"), ("xu", "ぅ"), ("xe", "ぇ"), ("xo", "ぉ"),
    ("la", "ぁ"), ("li", "ぃ"), ("lu", "ぅ"), ("le", "ぇ"), ("lo", "ぉ"),
    ("lyi", "ぃ"), ("xyi", "ぃ"), ("lye", "ぇ"), ("xye", "ぇ"),

    // ゔ行
    ("va", "ゔぁ"), ("vi", "ゔぃ"), ("vu", "ゔ"), ("ve", "ゔぇ"), ("vo", "ゔぉ"),

    // 表記揺れ
    ("wyi", "ゐ"), ("wye", "ゑ"),

    // -- 1文字 --
    ("a", "あ"), ("i", "い"), ("u", "う"), ("e", "え"), ("o", "お"),

    // 句読点
    (".", "。"),
    (",", "、"),

    // 記号
    ("-", "ー"),
    ("~", "～"),
    ("[", "「"),
    ("]", "」"),

    // 全角記号
    ("!", "！"),
    ("?", "？"),
    (":", "："),
    (";", "；"),
    ("(", "（"),
    (")", "）"),
    ("{", "｛"),
    ("}", "｝"),
    ("<", "＜"),
    (">", "＞"),
    ("/", "／"),
    ("\\", "＼"),
    ("|", "｜"),
    ("@", "＠"),
    ("#", "＃"),
    ("$", "＄"),
    ("%", "％"),
    ("&", "＆"),
    ("*", "＊"),
    ("+", "＋"),
    ("=", "＝"),
    ("^", "＾"),
    ("`", "｀"),
    ("_", "＿"),
    ("'", "＇"),
    ("\"", "＂"),

    // 全角数字
    ("0", "０"),
    ("1", "１"),
    ("2", "２"),
    ("3", "３"),
    ("4", "４"),
    ("5", "５"),
    ("6", "６"),
    ("7", "７"),
    ("8", "８"),
    ("9", "９"),

    // コマンド
    ("z/", "・"),
    ("z.", "…"),
    ("z,", "‥"),
    ("zh", "←"),
    ("zj", "↓"),
    ("zk", "↑"),
    ("zl", "→"),
    ("z-", "～"),
    ("z[", "『"),
    ("z]", "』"),
];